## Pandas 2
Nesta Aula:
- Como acessar nossas bases de dados utilizando os métodos Loc e iLoc;
- Aprender sobre funções agregadas e suas funcionalidades;
- Aprender métodos úteis como groupby e pivot_table;
- Explorar alguns outros métodos como merge, diff, pct_change e shift

### Importando as bibliotecas

In [1]:
import pandas as pd

In [2]:
# Leitura do dataset
maiores_empresas = pd.read_csv('maiores-companhias.csv')

# Exibindo as primeiras linhas do dataset
maiores_empresas.head()

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
0,1,Walmart,Retail,"611,289",6.7%,"2,100,000","Bentonville, Arkansas"
1,2,Amazon,Retail and cloud computing,"513,983",9.4%,"1,540,000","Seattle, Washington"
2,3,Exxon Mobil,Petroleum industry,"413,680",44.8%,"62,000","Spring, Texas"
3,4,Apple,Electronics industry,"394,328",7.8%,"164,000","Cupertino, California"
4,5,UnitedHealth Group,Healthcare,"324,162",12.7%,"400,000","Minnetonka, Minnesota"

In [3]:
# Verificar o tamanho dos dados (linhas e colunas)
maiores_empresas.shape

(100, 7)

In [4]:
# Verificar tipos de colunas e quantidade de entradas
maiores_empresas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Rank                    100 non-null    int64
 1   Name                    100 non-null    object
 2   Industry                100 non-null    object
 3   Revenue (USD millions)  100 non-null    object
 4   Revenue growth          100 non-null    object
 5   Employees               100 non-null    object
 6   Headquarters            100 non-null    object
dtypes: int64(1), object(6)
memory usage: 5.6+ KB

In [5]:
# Converter 'Revenue growth' para string e remover símbolos de porcentagem
maiores_empresas['Revenue growth'] = maiores_empresas['Revenue growth'].astype(str).str.rstrip('%').astype('float64')

# Remover vírgulas e converter 'Revenue (USD millions)'
maiores_empresas['Revenue (USD millions)'] = maiores_empresas['Revenue (USD millions)'].replace({',': ''}, regex=True).astype('float64')

# Mostrar as primeiras linhas do DataFrame após as conversões
maiores_empresas.head()

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
0,1,Walmart,Retail,611289.0,6.7,"2,100,000","Bentonville, Arkansas"
1,2,Amazon,Retail and cloud computing,513983.0,9.4,"1,540,000","Seattle, Washington"
2,3,Exxon Mobil,Petroleum industry,413680.0,44.8,"62,000","Spring, Texas"
3,4,Apple,Electronics industry,394328.0,7.8,"164,000","Cupertino, California"
4,5,UnitedHealth Group,Healthcare,324162.0,12.7,"400,000","Minnetonka, Minnesota"

In [6]:
maiores_empresas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Rank                    100 non-null    int64
 1   Name                    100 non-null    object
 2   Industry                100 non-null    object
 3   Revenue (USD millions)  100 non-null    float64
 4   Revenue growth          100 non-null    float64
 5   Employees               100 non-null    object
 6   Headquarters            100 non-null    object
dtypes: float64(2), int64(1), object(4)
memory usage: 5.6+ KB

## Loc e iLoc
### .loc[row_label, column_label]
A função .loc será utilizada para localizar e acessar dados em seu dataframe a partir do nome de uma linha e/ou coluna e retornará os valores correspondentes às linhas e colunas nomeadas.

Ex.: df.loc['Nome da Linha', 'Nome da Coluna']

### Selecionando apenas linhas com .loc

In [7]:
display(maiores_empresas)

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
0,1,Walmart,Retail,611289.0,6.7,"2,100,000","Bentonville, Arkansas"
1,2,Amazon,Retail and cloud computing,513983.0,9.4,"1,540,000","Seattle, Washington"
2,3,Exxon Mobil,Petroleum industry,413680.0,44.8,"62,000","Spring, Texas"
3,4,Apple,Electronics industry,394328.0,7.8,"164,000","Cupertino, California"
4,5,UnitedHealth Group,Healthcare,324162.0,12.7,"400,000","Minnetonka, Minnesota"
...,...,...,...,...,...,...,...
95,96,Best Buy,Retail,46298.0,10.6,"71,100","Richfield, Minnesota"
96,97,Bristol-Myers Squibb,Pharmaceutical industry,46159.0,0.5,"34,300","New York City, New York"
97,98,United Airlines,Airline,44955.0,82.5,"92,795","Chicago, Illinois"
98,99,Thermo Fisher Scientific,Laboratory instruments,44915.0,14.5,"130,000","Waltham, Massachusetts"
99,100,Qualcomm,Technology,44200.0,31.7,"51,000","San Diego, California"

In [8]:
# Selecionando apenas linhas

# Podemos chamar uma linha pelo seu índice

maiores_empresas.loc[0]

Rank                                          1
Name                                    Walmart
Industry                                 Retail
Revenue (USD millions)                 611289.0
Revenue growth                              6.7
Employees                             2,100,000
Headquarters              Bentonville, Arkansas
Name: 0, dtype: object

In [9]:
# Podemos chamar um array de índices

maiores_empresas.loc[[0, 1, 2, 4]]

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
0,1,Walmart,Retail,611289.0,6.7,"2,100,000","Bentonville, Arkansas"
1,2,Amazon,Retail and cloud computing,513983.0,9.4,"1,540,000","Seattle, Washington"
2,3,Exxon Mobil,Petroleum industry,413680.0,44.8,"62,000","Spring, Texas"
4,5,UnitedHealth Group,Healthcare,324162.0,12.7,"400,000","Minnetonka, Minnesota"

In [10]:
# Podemos chamar um intervalo de índices

maiores_empresas.loc[0:4]

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
0,1,Walmart,Retail,611289.0,6.7,"2,100,000","Bentonville, Arkansas"
1,2,Amazon,Retail and cloud computing,513983.0,9.4,"1,540,000","Seattle, Washington"
2,3,Exxon Mobil,Petroleum industry,413680.0,44.8,"62,000","Spring, Texas"
3,4,Apple,Electronics industry,394328.0,7.8,"164,000","Cupertino, California"
4,5,UnitedHealth Group,Healthcare,324162.0,12.7,"400,000","Minnetonka, Minnesota"

### .set_index

Utilizando set_index para definir um índice a partir de uma coluna

In [11]:
# Podemos achar a linha por seu valor contido

# Primeiro devemos definir uma coluna como index por meio do .set_index

maiores_empresas_index = maiores_empresas.set_index('Name')
maiores_empresas_index.head()

,Rank,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
Name,,,,,,
Walmart,1,Retail,611289.0,6.7,"2,100,000","Bentonville, Arkansas"
Amazon,2,Retail and cloud computing,513983.0,9.4,"1,540,000","Seattle, Washington"
Exxon Mobil,3,Petroleum industry,413680.0,44.8,"62,000","Spring, Texas"
Apple,4,Electronics industry,394328.0,7.8,"164,000","Cupertino, California"
UnitedHealth Group,5,Healthcare,324162.0,12.7,"400,000","Minnetonka, Minnesota"

In [12]:
# A partir disso, podemos buscar um valor contido dentro desta coluna

maiores_empresas_index.loc['Amazon']

Rank                                               2
Industry                  Retail and cloud computing
Revenue (USD millions)                      513983.0
Revenue growth                                   9.4
Employees                                  1,540,000
Headquarters                     Seattle, Washington
Name: Amazon, dtype: object

### Selecionando apenas colunas com .loc

In [13]:
maiores_empresas.head()

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
0,1,Walmart,Retail,611289.0,6.7,"2,100,000","Bentonville, Arkansas"
1,2,Amazon,Retail and cloud computing,513983.0,9.4,"1,540,000","Seattle, Washington"
2,3,Exxon Mobil,Petroleum industry,413680.0,44.8,"62,000","Spring, Texas"
3,4,Apple,Electronics industry,394328.0,7.8,"164,000","Cupertino, California"
4,5,UnitedHealth Group,Healthcare,324162.0,12.7,"400,000","Minnetonka, Minnesota"

In [14]:
# Selecionando apenas colunas por nomes
# Usando a base de dados sem 'Name' com index
maiores_empresas.loc[:, ['Rank', 'Name', 'Revenue (USD millions)']]

    Rank                      Name  Revenue (USD millions)
0      1                   Walmart                611289.0
1      2                    Amazon                513983.0
2      3               Exxon Mobil                413680.0
3      4                     Apple                394328.0
4      5        UnitedHealth Group                324162.0
..   ...                       ...                     ...
95    96                  Best Buy                 46298.0
96    97      Bristol-Myers Squibb                 46159.0
97    98           United Airlines                 44955.0
98    99  Thermo Fisher Scientific                 44915.0
99   100                  Qualcomm                 44200.0

[100 rows x 3 columns]

### Se eu tivesse usado o Dataframe que foi aplicado o .set_index?
Não conseguiri usar, já que o 'Name' está definido como index, logo, ele não pode ser chamado como uma coluna na função .loc

In [15]:
# KeyErro: "['Name'] not in index"
maiores_empresas_index.loc[:, ['Rank', 'Name', 'Revenue (USD millions)']]

KeyError: "['Name'] not in index"

In [16]:
# Não precisa chamar 'Name', porque ele já está definido como index pelo Python
maiores_empresas_index.loc[:, ['Rank', 'Revenue (USD millions)']]

                          Rank  Revenue (USD millions)
Name
Walmart                      1                611289.0
Amazon                       2                513983.0
Exxon Mobil                  3                413680.0
Apple                        4                394328.0
UnitedHealth Group           5                324162.0
...                        ...                     ...
Best Buy                    96                 46298.0
Bristol-Myers Squibb        97                 46159.0
United Airlines             98                 44955.0
Thermo Fisher Scientific    99                 44915.0
Qualcomm                   100                 44200.0

[100 rows x 2 columns]

In [17]:
# Selecionando um conjunto de linhas e colunas
maiores_empresas_index.loc[['Walmart', 'Amazon', 'Apple'], ['Rank', 'Industry', 'Revenue (USD millions)']]

         Rank                    Industry  Revenue (USD millions)
Name
Walmart     1                      Retail                611289.0
Amazon      2  Retail and cloud computing                513983.0
Apple       4        Electronics industry                394328.0

### Também podemos criar algumas condições a partir de .loc

In [18]:
# Como selecionar algumas colunas do dataframe a partir de algumas condições?

# Maiores empresas da 'Industry' sendo 'Retail'
maiores_empresas.loc[(maiores_empresas['Industry']) == 'Retail']

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
0,1,Walmart,Retail,611289.0,6.7,"2,100,000","Bentonville, Arkansas"
11,12,Costco,Retail,226954.0,15.8,"304,000","Issaquah, Washington"
19,20,The Home Depot,Retail,157403.0,4.1,"471,600","Atlanta, Georgia"
23,24,Kroger,Retail,148258.0,7.5,"430,000","Cincinnati, Ohio"
32,33,Target Corporation,Retail,109120.0,2.9,"440,000","Minneapolis, Minnesota"
38,39,Lowe's,Retail,97059.0,0.8,"244,500","Mooresville, North Carolina"
52,53,Albertsons,Retail,77650.0,8.0,"198,650","Boise, Idaho"
79,80,Publix,Retail,54942.0,13.5,"242,000","Lakeland, Florida"
88,89,TJX,Retail,49936.0,2.9,"329,000","Framingham, Massachusetts"
95,96,Best Buy,Retail,46298.0,10.6,"71,100","Richfield, Minnesota"

In [19]:
maiores_empresas.info

<bound method DataFrame.info of     Rank                      Name                    Industry  \
0      1                   Walmart                      Retail
1      2                    Amazon  Retail and cloud computing
2      3               Exxon Mobil          Petroleum industry
3      4                     Apple        Electronics industry
4      5        UnitedHealth Group                  Healthcare
..   ...                       ...                         ...
95    96                  Best Buy                      Retail
96    97      Bristol-Myers Squibb     Pharmaceutical industry
97    98           United Airlines                     Airline
98    99  Thermo Fisher Scientific      Laboratory instruments
99   100                  Qualcomm                  Technology

    Revenue (USD millions)  Revenue growth  Employees             Headquarters
0                 611289.0             6.7  2,100,000    Bentonville, Arkansas
1                 513983.0             9.4  1,540,000      Seattle, Washington
2                 413680.0            44.8     62,000            Spring, Texas
3                 394328.0             7.8    164,000    Cupertino, California
4                 324162.0            12.7    400,000    Minnetonka, Minnesota
..                     ...             ...        ...                      ...
95                 46298.0            10.6     71,100     Richfield, Minnesota
96                 46159.0             0.5     34,300  New York City, New York
97                 44955.0            82.5     92,795        Chicago, Illinois
98                 44915.0            14.5    130,000   Waltham, Massachusetts
99                 44200.0            31.7     51,000    San Diego, California

[100 rows x 7 columns]>

In [20]:
maiores_empresas.head()

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
0,1,Walmart,Retail,611289.0,6.7,"2,100,000","Bentonville, Arkansas"
1,2,Amazon,Retail and cloud computing,513983.0,9.4,"1,540,000","Seattle, Washington"
2,3,Exxon Mobil,Petroleum industry,413680.0,44.8,"62,000","Spring, Texas"
3,4,Apple,Electronics industry,394328.0,7.8,"164,000","Cupertino, California"
4,5,UnitedHealth Group,Healthcare,324162.0,12.7,"400,000","Minnetonka, Minnesota"

In [21]:
# Maiores empresas em que o 'Revenue growth' é maior que 50%
maiores_empresas.loc[(maiores_empresas['Revenue growth']) >= 50]

,Rank,Name,Industry,Revenue (USD millions),Revenue growth,Employees,Headquarters
9,10,Chevron Corporation,Petroleum industry,246252.0,51.6,"43,846","San Ramon, California"
16,17,Phillips 66,Petroleum industry,175702.0,53.0,"13,000","Houston, Texas"
17,18,Valero Energy,Petroleum industry,171189.0,58.0,"9,743","San Antonio, Texas"
48,49,ConocoPhillips,Petroleum industry,82156.0,69.9,"9,500","Houston, Texas"
49,50,Tesla,Automotive and Energy,81462.0,51.4,"127,855","Austin, Texas"
60,61,StoneX Group,Financials,66036.0,55.3,305,"New York City, New York"
65,66,TD Synnex,Infotech,62344.0,97.2,"28,500","Clearwater, Florida"
71,72,World Fuel Services,Petroleum industry and Logistics,59043.0,88.4,"5,214","Miami, Florida"
86,87,Delta Air Lines,Airline,50582.0,69.2,"95,000","Atlanta, Georgia"
90,91,American Airlines,Airline,48971.0,63.9,"129,700","Fort Worth, Texas"
92,93,Performance Food Group,Food Processing,47194.0,61.6,"34,825","Richmond, Virginia"
93,94,PBF Energy,Petroleum industry,46830.0,71.8,"3,616","Parsippany–Troy Hills, New Jersey"
97,98,United Airlines,Airline,44955.0,82.5,"92,795","Chicago, Illinois"